**Q1.    Write SQL query to get the second highest salary among all Employees?**

In [ ]:
SELECT MAX(Salary)
FROM HR.EMPLOYEES
WHERE Salary NOT IN (SELECT MAX(Salary) FROM HR.EMPLOYEES)

select MAX(Salary) from HR.EMPLOYEES
WHERE Salary <> (select MAX(Salary) from HR.EMPLOYEES)

SELECT Employee_Id, 
       first_Name, 
       Salary 
FROM(
   SELECT HR.EMPLOYEES.*, 
          DENSE_RANK() OVER(ORDER BY Salary DESC) as SALARY_RANK 
   FROM HR.EMPLOYEES)
WHERE SALARY_RANK =2

**Q2.    How can we retrieve alternate records from a table in Oracle?**

We can use rownum and MOD function to retrieve the alternate records from a table.

To get Even number records:

In [ ]:
SELECT * FROM (
SELECT EMP.*,
rownum rnum
FROM HR.EMPLOYEES EMP
) WHERE MOD(rnum, 2) = 0

To get Odd number records:

In [ ]:
SELECT * FROM (
SELECT EMP.*,
rownum rnum
FROM HR.EMPLOYEES EMP
) WHERE MOD(rnum, 2) = 1

**Q3.    Write a SQL Query to find Max salary and Department name from each department.**

In [ ]:
SELECT d.DEPARTMENT_NAME, MAX(nvl(e.Salary,0))
FROM HR.DEPARTMENTS d LEFT OUTER JOIN HR.EMPLOYEES e
ON e.DEPARTMENT_ID = d.DEPARTMENT_ID 
GROUP BY DEPARTMENT_NAME 
HAVING MAX(e.Salary)>0

**Q4.    Write a SQL query to find records in Table A that are not in Table B without using NOT IN operator.**

In [ ]:
SELECT * FROM Table_A
MINUS
SELECT * FROM Table_B

**Q5.    Write SQL Query to find employees that have same name and email.**

In [ ]:
SELECT FIRST_NAME, JOB_ID, COUNT(*)
FROM HR.EMPLOYEES
GROUP BY FIRST_NAME, JOB_ID
HAVING COUNT(*) > 1

**Q6.  Write SQL query to get the nth record among all Employees.**

In [ ]:
SELECT * FROM (
SELECT EMP.*,
rownum rnum
FROM HR.EMPLOYEES EMP
) WHERE rnum = 9

**Q7.    Write a Query to get Unique names of products without using DISTINCT keyword.**

In [ ]:
select distinct JOB_ID FROM HR.EMPLOYEES

select JOB_ID FROM HR.EMPLOYEES group by JOB_ID

**Q8.    Write a SQL query to maximum Zipcode from a table without using MAX or MIN aggregate functions.**

In [ ]:
SELECT DISTINCT SALARY
FROM HR.EMPLOYEES EMP 
WHERE SALARY NOT IN (
SELECT Smaller_salary.SALARY
FROM HR.EMPLOYEES Larger_salary
inner JOIN HR.EMPLOYEES Smaller_salary
ON Smaller_salary.SALARY < Larger_salary.SALARY
)

**Q9.    Given a list of employee names and email. Write a query to print a comma separated list of employee names in a email.**

In [ ]:
SELECT FIRST_NAME, LISTAGG(EMAIL, ',') WITHIN GROUP (ORDER BY EMAIL) EMAIL
FROM   HR.EMPLOYEES
GROUP BY FIRST_NAME

**Q10.    Given an Employee table with Manager_ID as column, print First name, Manager ID and Level of employees in Organization Structure?**

In [ ]:
SELECT FIRST_NAME, EMPLOYEE_ID, MANAGER_ID, LEVEL
FROM HR.EMPLOYEES
START WITH EMPLOYEE_ID = 100
CONNECT BY PRIOR EMPLOYEE_ID = MANAGER_ID;

**Q11. Write a query to get the first and last record from a table?**

In [ ]:
select * from HR.EMPLOYEES where Rownum =1

select * from HR.EMPLOYEES where RowID = (select min(RowID) from HR.EMPLOYEES);

select * from HR.EMPLOYEES where RowID = (select max(RowID) from HR.EMPLOYEES);

**Q12. Write a query to display the first ten records from a table.**

In [ ]:
select * from HR.EMPLOYEES where Rownum <=10

**Q13. Create a table with the same structure with data as in the Student table.**

In [ ]:
Create table HR.EMPLOYEES2 as Select * from HR.EMPLOYEES;

**Q14. Show only common records between two tables.**

In [ ]:
Select * from HR.EMPLOYEES;
Intersect
Select * from HR.EMPLOYEES2;

**Q15. How to find the employee with third MAX Salary using a SQL query without using Analytic Functions?**

In [ ]:
SELECT MAX(salary) as salary FROM HR.EMPLOYEES WHERE salary NOT IN (
    SELECT salary FROM(
    SELECT salary FROM HR.EMPLOYEES ORDER BY salary DESC)
    WHERE ROWNUM < 3);

**Q16. How to read LAST 5 records from a table using a SQL query?**

In [ ]:
SELECT * FROM HR.EMPLOYEES
MINUS
SELECT * FROM HR.EMPLOYEES WHERE ROWNUM <= (SELECT COUNT(*)-5 FROM HR.EMPLOYEES);

**Q17. How to read TOP 5 records from a table using a SQL query?**

In [ ]:
SELECT * FROM HR.EMPLOYEES WHERE ROWNUM <= 5;

**Q18. How to delete DUPLICATE records from a table using a SQL Query?**

In [ ]:
SELECT * FROM( 
SELECT ROWID,
       EMPLOYEE_ID,
       FIRST_NAME,SALARY,
       ROW_NUMBER() OVER(PARTITION BY FIRST_NAME  ORDER BY EMPLOYEE_ID) AS ROW_NUMBER 
FROM HR.EMPLOYEES EMP
)WHERE ROW_NUMBER > 1;